# Mean Encoding

In [1]:
import pandas as pd

data = pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
data.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [2]:
data['Cabin'].fillna('Missing',inplace=True)
data.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [3]:
data['Cabin'] = data['Cabin'].astype(str).str[0]
data.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [4]:
mean_encoder = data.groupby(['Cabin'])['Survived'].mean()
mean_encoder

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [5]:
data['mean_encoded'] = data['Cabin'].map(mean_encoder)
data.head()

   Survived Cabin  mean_encoded
0         0     M      0.299854
1         1     C      0.593220
2         1     M      0.299854
3         1     C      0.593220
4         0     M      0.299854